IDENTIFICATION DIVISION.
PROGRAM-ID. CUSTOMER-HANDLER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-CUSTOMER-ID       PIC 9(10).
PROCEDURE DIVISION.
MAIN-LOGIC.
    ACCEPT WS-CUSTOMER-ID.
    IF WS-CUSTOMER-ID = 0
        DISPLAY "Invalid ID".
    END-IF.
    STOP RUN.